            *>first cobol program
            IDENTIFICATION DIVISION.
            PROGRAM-ID. HELLO.
            PROCEDURE DIVISION.
            DISPLAY 'WILKOMMEN'.
            STOP RUN.
